{
    "recipe": [
        {
            "name": "Sweet Potatoes and Marshmallows With Brown-Sugar Glaze",
            "ingredients": [
                "4 pounds red-skinned sweet potatoes, peeled, cut into 1-inch pieces",
                "⅔ cup packed golden brown sugar",
                "5 tablespoons unsalted butter",
                "1 teaspoon ground cinnamon",
                "½ teaspoon salt",
                "¼ teaspoon ground nutmeg",
                "Pinch of ground ginger",
                "2 cups miniature marshmallows",
                "½ cup sliced almonds"
            ],
            "directions": [
                "Preheat oven to 375°F. Arrange potatoes in 13x9x2-inch glass baking dish. Combine sugar, butter, cinnamon, salt, nutmeg and ginger in heavy small saucepan over medium heat. Bring to boil, stirring until sugar dissolves. Pour over potatoes; toss to coat. Cover dish tightly with foil.",
                "Bake potatoes 50 minutes. Uncover; bake until potatoes are tender and syrup thickens slightly, basting occasionally, about 20 minutes.\nDO AHEAD: Bake the potatoes to this point up to three days ahead of time. Cool, then store covered in the refrigerator. Reheat, covered, in a 375°F oven until warmed through, 8–10 minutes.",
                "Increase oven temperature to 500°F. Top potatoes with marshmallows and nuts. Return to oven; bake until marshmallows begin to melt and nuts begin to brown, about 3 minutes."
            ]
        },
        {
            "name": "Deep-Fried Turkey With Herbs",
            "ingredients": [
                "1 (12- to 14- pound) turkey, neck and giblets removed",
                "4 to 5 gallons peanut or canola oil",
                "3 tablespoons kosher salt",
                "1½ tablespoons freshly ground black pepper",
                "1½ tablespoons dried thyme",
                "1½ tablespoons dried rosemary",
                "1½ tablespoons ground paprika",
                "Equipment: Turkey frying kit (30-quart or larger aluminum pot; propane burner with a hose that connects to a propane tank and a gauge for regulating the flame; poultry rack with a hook for lowering and raising the turkey in the pot; 12-inch deep-fry thermometer that clips to the side of the pot to monitor the oil temperature); a full propane gas tank; a waterproof marker; an apron; long heavy-duty oven mitts; an instant-read meat thermometer; fire extinguisher—just in case."
            ],
            "directions": [
                "Place the turkey in the empty fryer pot and cover it with about 2 inches of water. Remove the turkey from the pot, thoroughly pat dry with paper towels, and set it aside at room temperature. Use a waterproof marker to mark the water level on the inside or outside of the pot so you know how much oil to put in the pot. Discard the water then wash and dry the pot thoroughly.",
                "Arrange the burner on a flat surface far away from the house, garage, or anything that could easily catch fire. Place the pot over the burner and clip a long-pronged deep-fry thermometer to the side of the pot. Using the mark you made earlier, fill the pot with oil. Heat the oil until the thermometer reaches 375°F.",
                "While the oil is heating, make the rub: In a small bowl, whisk together the salt, pepper, thyme, rosemary, and paprika. DO AHEAD: The herb rub can be prepared ahead and kept, in an airtight container, up to 1 month.",
                "Starting at the neck end of the turkey, slowly and carefully slide your hand between the skin and the meat of the breast, thighs, and upper drumsticks to separate and loosen the skin. Spread the herb rub under the skin on the thighs, drumsticks, and breasts. Spread any remaining rub inside the turkey cavity and on top of the skin. To ensure good oil flow, make sure the neck cavity is wide open, and use a small sharp knife to cut a small slit through the skin where the leg meets the breast.",
                "Place the turkey on the poultry rack, with the breast facing down and the legs facing up. Once the oil reaches 375°F, turn off the burner. Wearing an apron and long heavy-duty oven mitts, use the hook that attaches to the rack to slowly lower the turkey into the oil using a stop-and-go method—slowly lower the turkey 1 to 2 inches into the oil then pull it back out a bit, repeating until the bird is fully submerged. Turn the burner back on and bring the oil to 350°F. Throughout frying, adjust the heat as necessary to maintain the 350°F oil temperature. Fry the turkey for about 3½ minutes per pound. Use the hook that attaches to the rack to slowly and carefully remove the turkey from the oil and place it on a cutting board or large rimmed baking sheet. Using an instant-read thermometer, test the fleshy part of the thighs and the thickest part of the breasts (test both sides, close to but not touching the bone); the thermometer needs to register at least 165°F. If not, use the hook to slowly and carefully lower the turkey back into the oil to finish frying. Once the internal temperature reaches 165°F, transfer the turkey to a cutting board, cover with foil, and let it rest 20 to 30 minutes before carving and serving."
            ]
        },
        {
            "name": "Chocolate Pecan Pie",
            "ingredients": [
                "1⅓ cups (175 grams) all-purpose flour",
                "½ teaspoon salt",
                "8 Tbsp. (115 grams/1 stick) unsalted butter, or 9 Tbsp. (130 grams) if using unbleached flour",
                "¼ cup plain yogurt",
                "1 Tbsp. ice water, plus more if necessary",
                "2 cups (7 ounces/200 grams) pecan halves",
                "2 ounces (55 grams) 54% to 64% chocolate, coarsely chopped (see Chocolate Notes)",
                "¼ cup light corn syrup",
                "1 Tbsp. (14 grams) unsalted butter, melted",
                "1 cup (170 grams) lightly packed dark brown sugar",
                "¼ tsp. salt",
                "1 Tbsp. rum, bourbon, or brandy",
                "1 tsp. pure vanilla extract",
                "3 large eggs"
            ],
            "directions": [
                "Thoroughly mix the flour and salt in a large bowl. Cut the butter into chunks and add it to the bowl. Using two knives or a pastry blender, cut the butter into successively smaller pieces, scraping the bottom of the bowl and tossing the pieces to coat and separate them with flour as you work, until the largest pieces of butter are the size of peas and the rest bread-crumb size. (Do not let the butter melt or form a paste.) Mix the yogurt with the 1 tablespoon ice water and drizzle it over the flour mixture, tossing with a rubber spatula or a fork, folding and pressing the dough to distribute the moisture. If necessary, drizzle up to 1 more tablespoon water, until the dough is just moist enough to hold together when pressed. Dump the dough onto a sheet of plastic wrap and compress it into a flat disk, pressing in any loose pieces. Wrap in the plastic wrap and refrigerate for at least 1 hour, or for up to 3 days.",
                "Remove the dough from the refrigerator and let it stand until it is pliable enough to roll without severe cracking. On a lightly floured surface, roll the dough into a 14-inch circle about ⅛ inch thick, rotating and dusting the surface with flour to keep it from sticking. Brush the excess flour from the rolled-out circle, fold the circle into quarters, and transfer it to the pie pan. Unfold, easing the pastry into the pan without stretching it. Trim the overhang to about 1 inch. Turn the excess dough under and flute or crimp the edge. Refrigerate for at least 45 minutes before baking. (Reserve a few dough scraps for later patching if necessary.)",
                "Position a rack in the lower third of the oven and preheat the oven to 350°F. Spread the nuts on a baking sheet and bake for 6 to 9 minutes, until fragrant and lightly colored. Set aside.",
                "Increase the oven temperature to 400°F and let preheat.",
                "Press a 12-inch square of foil, shiny side down, against the bottom and up the sides of the crust. Tent the edges of the foil over (not touching) the edges of the crust, like an awning, to prevent overbrowning. Prick the bottom of the crust all over with a fork, piercing right through the foil. Fill the foil-lined crust with dried beans or pie weights.",
                "Bake the crust for 20 minutes. Remove the foil liner and weights. Bake for 10 to 12 minutes more, until the bottom of the crust is golden brown.",
                "While the crust is baking, make the filling: Combine the chocolate, corn syrup, and butter in the top of a double boiler over barely simmering water. Stir until the chocolate is completely melted and the mixture is smooth. Stir in the brown sugar, salt, rum, and vanilla. Add the eggs and stir until the mixture is well blended and hot to the touch. Set the double boiler aside, stirring the filling from time to time.",
                "When the crust is baked, remove it from the oven. (Leave the oven on.) If necessary, press bits of reserved dough into any holes or cracks in the crust. Pour the pecans into the crust and the hot filling over the nuts.",
                "Bake until the filling is puffed and cracked at the edges and brown in patches but still jiggles in the center when nudged, 10 to 12 minutes. A knife inserted in the pie will emerge very gooey. If the edges of the crust are browning too fast before the pie is done, cover with a 12-inch square of foil with a 7-inch circle cut out from its center. Cool the pie on a rack. Serve warm or at room temperature."
            ]
        },
        {
            "name": "Bittersweet Chocolate Glaze",
            "ingredients": [
                "6 ounces (170 grams) 54% to 72% chocolate, coarsely chopped",
                "8 tablespoons (115 grams/1 stick) unsalted butter, cut into several pieces",
                "1 tablespoon light corn syrup",
                "Pinch of salt (optional)"
            ],
            "directions": [
                "Place the chocolate, butter, and corn syrup in a small heatproof bowl set in a wide skillet of barely simmering water. Stir frequently and gently (to prevent air bubbles) with a spatula or wooden spoon until the chocolate is almost completely melted. Remove the glaze from the water and set aside to finish melting, stirring once or twice until the glaze is perfectly smooth.",
                "Or, melt in a microwave on Medium (50%) power for about 2 minutes. Stir gently until completely smooth; do not whisk or beat. Taste and consider adding the salt. To use for crumb coating a cake before glazing it, let cool, without stirring, to a soft frosting consistency. To use as glaze, reheat gently in a pan of hot water (or let cool if just made) to 90°F (for optimal shine) before pouring. (The glaze can be kept, covered and refrigerated, for up to 2 weeks; or freeze it in a sealed container for up to 6 months. Soften or defrost in a pan of hot water or in the microwave.)"
            ]
        },
        {
            "name": "Pistachio-Cherry Cake",
            "ingredients": [
                "1½ cups (175 g) shelled pistachios",
                "⅔ cup (150 g) unsalted butter",
                "¾ cup plus 2 Tbsp. (175 g) superfine/caster sugar",
                "1 tsp. vanilla bean paste",
                "2 eggs",
                "⅔ cup (80 g) all-purpose flour",
                "1 tsp. baking powder",
                "1 Tbsp. (15 ml) sour cream",
                "⅔ cup (100 g) fresh pitted cherries, plus extra to decorate",
                "Confectioners’ sugar, to dust"
            ],
            "directions": [
                "Preheat the oven to 350°F (180°C). Grease a round 8-inch (20-cm) cake pan and line with parchment paper.",
                "Add the pistachios to a food processor and pulse until you have a fine powder. Set aside.",
                "Using a stand mixer or electric whisk, beat the butter, sugar and vanilla for 3 to 5 minutes, or until pale and creamy. Add the eggs one at a time, beating well after each addition and scraping down the sides of the bowl every so often. Add the flour, baking powder and ground pistachios, mixing on low speed until just combined. Stir in the sour cream before transferring the batter to the prepared pan. Smooth the surface of the batter with an offset spatula and arrange the cherries randomly on top without pressing them into the batter.",
                "Bake for 32 to 38 minutes, or until the cake is well browned and a toothpick inserted into the center comes out clean. Let the cake cool for 10 minutes before removing from the pan and setting on a wire rack. Once the cake is completely cool, use a sieve to dust lightly with confectioners’ sugar and top with extra cherries."
            ]
        },
        {
            "name": "Confit Turkey With Chiles and Garlic Recipe",
            "ingredients": [
                "1 Tbsp. light brown sugar",
                "2 tsp. cracked black pepper",
                "2 Tbsp. plus ¼ tsp. kosher salt",
                "2 whole turkey legs (4–5 lb. total)",
                "6 garlic cloves, smashed, plus 2 heads of garlic, divided",
                "8 guajillo, ancho, or New Mexico chiles, stems and seeds removed",
                "4 sprigs oregano or 1 tsp. dried oregano",
                "3–4 cups (or more) extra-virgin olive oil",
                "2 tsp. (or more) crushed red pepper flakes",
                "½ cup unsalted roasted almonds or peanuts",
                "¼ cup toasted sesame seeds"
            ],
            "directions": [
                "Combine brown sugar, black pepper, and 2 Tbsp. kosher salt in a small bowl. Place turkey legs in a baking dish just big enough to fit them or a medium Dutch oven. Sprinkle all over with brown sugar mixture and scatter smashed garlic cloves around. Let sit at room temperature at least 2 hours, or chill up to 12 hours (more time makes a big difference).",
                "Place a rack in middle of oven; preheat to 275°F. Cut heads of garlic heads in half crosswise. Nestle around turkey legs along with chiles and oregano sprigs. Pour in oil until turkey is mostly if not completely submerged (shove chiles down since they can burn if above the surface of the oil). You may need a bit more oil depending on your pot and size of turkey legs; don’t worry, this oil can be reused in all kinds of ways so it won’t go to waste!",
                "Braise turkey, uncovered, until meat has shrunk away from drumsticks dramatically and meat shreds easily with firm pressure, 3–4 hours (a few bubbles is okay, but anything above a lazy simmer and you should reduce the heat). Let meat rest, still submerged in fat, at least 1 hour.",
                "Pick out chiles from braising oil with tongs and place in a blender; add red pepper flakes and 1 cup braising oil. Let cool slightly, then blend until chiles are coarsely chopped. Add almonds and pulse until largest pieces are no bigger than a red pepper flake. Add sesame seeds and pulse just to combine. Season with remaining ¼ tsp. salt and add more red pepper flakes if desired.",
                "If eating right away, heat 2 Tbsp. braising oil in a large nonstick or cast-iron skillet over medium heat. Cook turkey legs, carefully turning with 2 pairs of tongs, until brown and crisp all over, 8–10 minutes. Serve with the almond-chile sauce.",
                "Don’t discard the braising oil or the juices below: Strain through a fine-mesh sieve into a heatproof container. Skim off fat to use for roasting potatoes, or your next confit project. Use juices in another braise, or stir into a pot of beans.",
                "Do ahead: Turkey can be braised 4 days ahead. Let cool, cover and chill (still in oil). Reheat, uncovered, in a 275°F oven until warmed through, about 40 minutes, before browning."
            ]
        }
    ]
}